In [ ]:
# pip install matplotlib

Подгружаю библиотеки

In [6]:
import pandas as pd
import numpy as np
# import matplotlib.pyplot as pltgit status

Загружаю файл с визитами Visits.csv

In [7]:
visits = pd.read_csv('Visits.csv', sep=';')

In [8]:
visits.head(3)

         date   shop_id  stuff_id  Month
0  13.07.2021  OF003018  OFFMR048      7
1  20.07.2021  OF003018  OFFMR048      7
2  27.07.2021  OF003018  OFFMR048      7

In [45]:
visits.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104961 entries, 0 to 104960
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   date      104961 non-null  object
 1   shop_id   104961 non-null  object
 2   stuff_id  104961 non-null  object
 3   Month     104961 non-null  int64
dtypes: int64(1), object(3)
memory usage: 3.2+ MB

Загружаю справочник по id

In [11]:
guide = pd.read_csv('Guide_shop_address.csv', sep=';')

In [12]:
guide.head(3)

   shop_id_sales   shop_id shop_name
0          45832  OF000086         C
1          45282  OF000090         C
2          37533  OF000106         C

In [44]:
guide.info(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2950 entries, 0 to 2949
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   shop_id_sales  2950 non-null   int64
 1   shop_id        2950 non-null   object
 2   shop_name      2950 non-null   object
dtypes: int64(1), object(2)
memory usage: 69.3+ KB

Объединяю таблицы

In [16]:
visit_guide = pd.merge(left=visits, right=guide,  how='inner', on='shop_id')

Проверяю кол-во строк в датасете

In [17]:
visit_guide.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 104961 entries, 0 to 104960
Data columns (total 6 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   date           104961 non-null  object
 1   shop_id        104961 non-null  object
 2   stuff_id       104961 non-null  object
 3   Month          104961 non-null  int64
 4   shop_id_sales  104961 non-null  int64
 5   shop_name      104961 non-null  object
dtypes: int64(2), object(4)
memory usage: 5.6+ MB

In [46]:
visit_guide.head(3)

         date   shop_id  stuff_id  Month  shop_id_sales shop_name
0  13.07.2021  OF003018  OFFMR048      7          55355         C
1  20.07.2021  OF003018  OFFMR048      7          55355         C
2  27.07.2021  OF003018  OFFMR048      7          55355         C

Группирую по месяцам и получаю кол-во визитов в месяц по каждой ТТ

In [19]:
visit_count_by_month = visit_guide.groupby(['shop_id','stuff_id','Month','shop_id_sales']).count()

Переименовываю столбец

In [22]:
visit_count_by_month.rename(columns = {'date' : 'count_visits_by_month'}, inplace = True)

In [31]:
visit_count_by_month = visit_count_by_month[['count_visits_by_month']].reset_index()

In [32]:
visit_count_by_month.head()

    shop_id  stuff_id  Month  shop_id_sales  count_visits_by_month
0  OF000015  OFFMR039     10         206328                      1
1  OF000015  OFFMR039     11         206328                      5
2  OF000015  OFFMR039     12         206328                      4
3  OF000015  OFFMR039     13         206328                      1
4  OF000015  OFFMR039     14         206328                      3

In [36]:
sales = pd.read_csv('Sales.csv', sep=';')

In [37]:
sales.head(3)

,Month,shop_id_sales,ChainName,FedDistrict,FedSubject,City_village,Other_Sales,Self_sales
0,10,27880,A,CFO,33,1,"47,98","3,64"
1,10,27894,A,CFO,40,1,"48,8","3,12"
2,10,27897,A,NWFO,47,0,"76,44","5,07"

In [35]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 379943 entries, 0 to 379942
Data columns (total 8 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Month          379943 non-null  int64
 1   Shop_id_sales  379943 non-null  int64
 2   ChainName      379943 non-null  object
 3   FedDistrict    379943 non-null  object
 4   FedSubject     379943 non-null  object
 5   City_village   379943 non-null  int64
 6   Other_Sales    379943 non-null  object
 7   Self_sales     379943 non-null  object
dtypes: int64(3), object(5)
memory usage: 23.2+ MB

In [40]:
df = pd.merge(left=sales, right=visit_count_by_month,  how='left', on=['shop_id_sales','Month'])

In [42]:
df.head()

,Month,shop_id_sales,ChainName,FedDistrict,FedSubject,City_village,Other_Sales,Self_sales,shop_id,stuff_id,count_visits_by_month
0,10,27880,A,CFO,33,1,"47,98","3,64",OF019074,OFFMR029,8.0
1,10,27880,A,CFO,33,1,"47,98","3,64",OF019074,OFFMR039,3.0
2,10,27894,A,CFO,40,1,"48,8","3,12",OF018681,OFFMR064,5.0
3,10,27897,A,NWFO,47,0,"76,44","5,07",NaN,NaN,NaN
4,10,27903,A,NWFO,47,0,"44,34","2,2",NaN,NaN,NaN

In [43]:
df.describe()

               Month  shop_id_sales   City_village  count_visits_by_month
count  380706.000000  380706.000000  380706.000000           26955.000000
mean        9.103111  158310.087524       0.481206               4.120683
std         3.749783   93939.489459       0.499647               2.371929
min         3.000000   27851.000000       0.000000               1.000000
25%         6.000000   51903.000000       0.000000               2.000000
50%         9.000000  201579.000000       0.000000               4.000000
75%        12.000000  211898.000000       1.000000               5.000000
max        15.000000  358051.000000       1.000000              14.000000